# GetPhysicalNetworksNumber Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..GetPhysicalNetworksNumber Method
MEPSystem Class See Also
---
Get the physical networks number in the system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int GetPhysicalNetworksNumber()
```

Visual Basic
---
```text
Public Function GetPhysicalNetworksNumber As Integer
```

Visual C++
---
```text
public:
int GetPhysicalNetworksNumber()
```

# ### Return Value
The number of physical networks.
# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace